app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-07-22 16:59:30.082642"], ["id", 1]]
---
  def update
    find_article
    @article.update(title: params[:article][:title], description: params[:article][:description])